kristiangoystdal/Audio_Watermark_Generator/STM32_New/Core/Src/main.c
  // Fill the first half of the buffer based on the current bit
  result = fill_half_buffer((uint32_t *)&output_buffer[BUFFER_SIZE / 2],
                            current_bit, next_bit, BUFFER_SIZE / 2,
                            current_sine_period, current_sine_index);

  moved_to_next_bit = result.moved_to_next_bit;
  current_sine_period = result.current_period;
  current_sine_index = result.current_index;

  if (moved_to_next_bit) {
    printf("Moved to next bit (full)\r\n");
    moved_to_next_bit = false;
    current_bitstream_index = (current_bitstream_index + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_bitstream_index];
    next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  }
}

static void TX_Start(void) {
  printf("\r\nTX_Start()\r\n");

  // Reset TX state
  current_bitstream_index = 0;
  current_bit = bitstream[current_bitstream_index];
  next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  current_sine_period = 0;
  current_sine_index = 0;
  tx_active = true;

  printf("  State reset OK\r\n");

  // Prefill both halves
  FillResult r1 = fill_half_buffer((uint32_t *)&output_buffer[0], current_bit,
                                   next_bit, BUFFER_SIZE / 2,
                                   current_sine_period, current_sine_index);
  current_sine_period = r1.current_period;
  current_sine_index = r1.current_index;
  if (r1.moved_to_next_bit) {
    current_bitstream_index = (current_bitstream_index + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_bitstream_index];
    next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  }

  FillResult r2 = fill_half_buffer((uint32_t *)&output_buffer[BUFFER_SIZE / 2],
                                   current_bit, next_bit, BUFFER_SIZE / 2,
                                   current_sine_period, current_sine_index);
  current_sine_period = r2.current_period;
  current_sine_index = r2.current_index;
  if (r2.moved_to_next_bit) {
    current_bitstream_index = (current_bitstream_index + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_bitstream_index];
    next_bit = bitstream[(current_bitstream_index + 1) % BITSTREAM_LENGTH];
  }

  printf("  Buffer filled\r\n");

  // Clean start
  HAL_TIM_Base_Stop(&htim2);
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);
  HAL_DAC_Stop(&hdac1, DAC_CHANNEL_1);

  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  printf("  Peripherals stopped & DMA flags cleared\r\n");

  // Start DAC
  HAL_StatusTypeDef st;
  st = HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);
  printf("  HAL_DAC_Start = %d, CR=0x%08lx\r\n", st, (unsigned long)DAC1->CR);

  // Start DMA
  st = HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                         BUFFER_SIZE, DAC_ALIGN_12B_R);

  DMA_Channel_TypeDef *ch = (DMA_Channel_TypeDef *)hdma_dac1_ch1.Instance;

  printf("  HAL_DAC_Start_DMA = %d\r\n", st);
  printf("    CPAR=0x%08lx CMAR=0x%08lx CNDTR=%lu CCR=0x%08lx\r\n",
         (unsigned long)ch->CPAR, (unsigned long)ch->CMAR,
         (unsigned long)ch->CNDTR, (unsigned long)ch->CCR);

  // Ensure trigger enabled
  SET_BIT(DAC1->CR, DAC_CR_TEN1);

  // Start timer last
  __HAL_TIM_SET_COUNTER(&htim2, 0);
  st = HAL_TIM_Base_Start(&htim2);
  printf("  TIM2 start = %d\r\n", st);

  // Quick sanity check
  uint32_t n0 = ch->CNDTR;
  uint32_t t0 = TIM2->CNT;
  HAL_Delay(2);
  uint32_t n1 = ch->CNDTR;
  uint32_t t1 = TIM2->CNT;

  printf("  RUN: CNDTR %lu→%lu | TIM2 %lu→%lu | DMA_EN=%lu\r\n",
         (unsigned long)n0, (unsigned long)n1, (unsigned long)t0,
         (unsigned long)t1, (unsigned long)((ch->CCR & DMA_CCR_EN) != 0));
}

static void TX_Stop(void) {
  printf("TX_Stop()\r\n");

  tx_active = false;

  HAL_TIM_Base_Stop(&htim2);
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);
  HAL_DAC_Stop(&hdac1, DAC_CHANNEL_1);

  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  printf("  TX stopped cleanly\r\n");
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
